[
  "Petra is listed in Egyptian campaign accounts and the Amarna letters as Pel, Sela or Seir.[citation needed]\n",
  "A stele dedicated to Qos-Allah 'Qos is Allah' or 'Qos the god', by Qosmilk (melech – king) is found at Petra (Glueck 516). Qos is identifiable with Kaush (Qaush) the God of the older Edomites. The stele is horned and the seal from the Edomite Tawilan near Petra identified with Kaush displays a star and crescent (Browning 28), both consistent with a moon deity. It is conceivable that the latter could have resulted from trade with Harran (Bartlett 194). There is continuing debate about the nature of Qos (qaus – bow) who has been identified both with a hunting bow (hunting god) and a rainbow (weather god) although the crescent above the stele is also a bow.[citation needed]\n",
  "Recently, Petra has been put forward as the original \"Mecca\" by some in the revisionist school of Islamic studies, owing to claims of large numbers of independent pieces of evidence,[citation needed] namely that the early original mosques faced Petra, not Jerusalem or Mecca, as the direction of Muslim prayer, the Qibla.[60] However, others have challenged the notion of comparing modern readings of Qiblah directions to early mosques’ Qiblahs as they claim early Muslims could not accurately calculate the direction of the Qiblah to Mecca and so the apparent pinpointing of Petra by some early mosques may well be coincidental.[61]\n",
  "The Monastery, Petra's largest monument, dates from the 1st century BC. It was dedicated to Obodas I and is believed to be the symposium of Obodas the god. This information is inscribed on the ruins of the Monastery (the name is the translation of the Arabic Ad Deir).[citation needed]\n",
  "The Bidoul/Bidul (Petra Bedouin) were forcibly resettled from their cave dwellings in Petra to Umm Sayhoun/Um Seihun by the Jordanian government in 1985, prior to the UNESCO designation process.[citation needed] They were provided with block-built housing with some infrastructure including in particular a sewage and drainage system. Among the six communities in the Petra Region, Umm Sayhoun is one of the smaller communities. The village of Wadi Musa is the largest in the area, inhabited largely by the Layathnah Bedouin, and is now the closest settlement to the visitor centre, the main entrance via the Siq and the archaeological site generally. Umm Sayhoun gives access to the 'back route' into the site, the Wadi Turkmaniyeh pedestrian route.[64]\n"
]
